In [1]:
import pandas as pd
d=pd.read_csv("pari.csv")
print(d)

     name      marks education   y.o.b
0     Anu  19.234567       NaN  2003.0
1    Mani  30.234560   diploma  1992.0
2    Pari  21.234560       bsc  2000.0
3  Suresh  30.345600       NaN  1991.0
4   Jessi  10.456700       6th  2012.0
5    Manu   7.456780       3rd  2015.0
6     NaN  50.345670       8th     NaN
7    jhon  12.346000       NaN  2010.0
8    jack  45.345670    m.tech     NaN

In [2]:
d.isnull()

    name  marks  education  y.o.b
0  False  False       True  False
1  False  False      False  False
2  False  False      False  False
3  False  False       True  False
4  False  False      False  False
5  False  False      False  False
6   True  False      False   True
7  False  False       True  False
8  False  False      False   True

In [3]:
d.isnull().sum()

name         1
marks        0
education    3
y.o.b        2
dtype: int64

In [4]:
d.isnull().sum().sum()

6

In [5]:
df=d.fillna(value=0)
print(df)

     name      marks education   y.o.b
0     Anu  19.234567         0  2003.0
1    Mani  30.234560   diploma  1992.0
2    Pari  21.234560       bsc  2000.0
3  Suresh  30.345600         0  1991.0
4   Jessi  10.456700       6th  2012.0
5    Manu   7.456780       3rd  2015.0
6       0  50.345670       8th     0.0
7    jhon  12.346000         0  2010.0
8    jack  45.345670    m.tech     0.0

In [6]:
df=d.fillna(value="anu")
print(df)

     name      marks education   y.o.b
0     Anu  19.234567       anu  2003.0
1    Mani  30.234560   diploma  1992.0
2    Pari  21.234560       bsc  2000.0
3  Suresh  30.345600       anu  1991.0
4   Jessi  10.456700       6th  2012.0
5    Manu   7.456780       3rd  2015.0
6     anu  50.345670       8th     anu
7    jhon  12.346000       anu  2010.0
8    jack  45.345670    m.tech     anu

In [7]:
y=d.fillna(method="pad")
print(y)

     name      marks education   y.o.b
0     Anu  19.234567       NaN  2003.0
1    Mani  30.234560   diploma  1992.0
2    Pari  21.234560       bsc  2000.0
3  Suresh  30.345600       bsc  1991.0
4   Jessi  10.456700       6th  2012.0
5    Manu   7.456780       3rd  2015.0
6    Manu  50.345670       8th  2015.0
7    jhon  12.346000       8th  2010.0
8    jack  45.345670    m.tech  2010.0

In [8]:
y=d.fillna(method="bfill")
print(y)

     name      marks education   y.o.b
0     Anu  19.234567   diploma  2003.0
1    Mani  30.234560   diploma  1992.0
2    Pari  21.234560       bsc  2000.0
3  Suresh  30.345600       6th  1991.0
4   Jessi  10.456700       6th  2012.0
5    Manu   7.456780       3rd  2015.0
6    jhon  50.345670       8th  2010.0
7    jhon  12.346000    m.tech  2010.0
8    jack  45.345670    m.tech     NaN

In [9]:
y=d.fillna(method="pad",axis=1)
print(y)

     name      marks  education   y.o.b
0     Anu  19.234567  19.234567  2003.0
1    Mani   30.23456    diploma  1992.0
2    Pari   21.23456        bsc  2000.0
3  Suresh    30.3456    30.3456  1991.0
4   Jessi    10.4567        6th  2012.0
5    Manu    7.45678        3rd  2015.0
6     NaN   50.34567        8th     8th
7    jhon     12.346     12.346  2010.0
8    jack   45.34567     m.tech  m.tech

In [10]:
y=d.fillna(method="bfill",axis=1)
print(y)

       name      marks education   y.o.b
0       Anu  19.234567    2003.0  2003.0
1      Mani   30.23456   diploma  1992.0
2      Pari   21.23456       bsc  2000.0
3    Suresh    30.3456    1991.0  1991.0
4     Jessi    10.4567       6th  2012.0
5      Manu    7.45678       3rd  2015.0
6  50.34567   50.34567       8th     NaN
7      jhon     12.346    2010.0  2010.0
8      jack   45.34567    m.tech     NaN

In [14]:
y=d.fillna({"y.o.b":2020,"education":"10th"})
print(y)

     name      marks education   y.o.b
0     Anu  19.234567      10th  2003.0
1    Mani  30.234560   diploma  1992.0
2    Pari  21.234560       bsc  2000.0
3  Suresh  30.345600      10th  1991.0
4   Jessi  10.456700       6th  2012.0
5    Manu   7.456780       3rd  2015.0
6     NaN  50.345670       8th  2020.0
7    jhon  12.346000      10th  2010.0
8    jack  45.345670    m.tech  2020.0

In [18]:
y=d.fillna(value=d["marks"].mean())
print(y)

        name      marks  education        y.o.b
0        Anu  19.234567  25.222234  2003.000000
1       Mani  30.234560    diploma  1992.000000
2       Pari  21.234560        bsc  2000.000000
3     Suresh  30.345600  25.222234  1991.000000
4      Jessi  10.456700        6th  2012.000000
5       Manu   7.456780        3rd  2015.000000
6  25.222234  50.345670        8th    25.222234
7       jhon  12.346000  25.222234  2010.000000
8       jack  45.345670     m.tech    25.222234

In [19]:
y=d.fillna(value=d["marks"].max())
print(y)

       name      marks education       y.o.b
0       Anu  19.234567  50.34567  2003.00000
1      Mani  30.234560   diploma  1992.00000
2      Pari  21.234560       bsc  2000.00000
3    Suresh  30.345600  50.34567  1991.00000
4     Jessi  10.456700       6th  2012.00000
5      Manu   7.456780       3rd  2015.00000
6  50.34567  50.345670       8th    50.34567
7      jhon  12.346000  50.34567  2010.00000
8      jack  45.345670    m.tech    50.34567

In [20]:
y=d.fillna(value=d["marks"].min())
print(y)

      name      marks education       y.o.b
0      Anu  19.234567   7.45678  2003.00000
1     Mani  30.234560   diploma  1992.00000
2     Pari  21.234560       bsc  2000.00000
3   Suresh  30.345600   7.45678  1991.00000
4    Jessi  10.456700       6th  2012.00000
5     Manu   7.456780       3rd  2015.00000
6  7.45678  50.345670       8th     7.45678
7     jhon  12.346000   7.45678  2010.00000
8     jack  45.345670    m.tech     7.45678

In [21]:
import numpy as np
x=d.replace(to_replace=np.nan,value=2204)
print(x)

     name      marks education   y.o.b
0     Anu  19.234567      2204  2003.0
1    Mani  30.234560   diploma  1992.0
2    Pari  21.234560       bsc  2000.0
3  Suresh  30.345600      2204  1991.0
4   Jessi  10.456700       6th  2012.0
5    Manu   7.456780       3rd  2015.0
6    2204  50.345670       8th  2204.0
7    jhon  12.346000      2204  2010.0
8    jack  45.345670    m.tech  2204.0

In [23]:
d["marks"]=d["marks"].interpolate(method="linear")
print(d)

     name      marks education   y.o.b
0     Anu  19.234567       NaN  2003.0
1    Mani  30.234560   diploma  1992.0
2    Pari  21.234560       bsc  2000.0
3  Suresh  30.345600       NaN  1991.0
4   Jessi  10.456700       6th  2012.0
5    Manu   7.456780       3rd  2015.0
6     NaN  50.345670       8th     NaN
7    jhon  12.346000       NaN  2010.0
8    jack  45.345670    m.tech     NaN

In [24]:
d.dropna()

    name     marks education   y.o.b
1   Mani  30.23456   diploma  1992.0
2   Pari  21.23456       bsc  2000.0
4  Jessi  10.45670       6th  2012.0
5   Manu   7.45678       3rd  2015.0

In [26]:
d.dropna(how="all")

     name      marks education   y.o.b
0     Anu  19.234567       NaN  2003.0
1    Mani  30.234560   diploma  1992.0
2    Pari  21.234560       bsc  2000.0
3  Suresh  30.345600       NaN  1991.0
4   Jessi  10.456700       6th  2012.0
5    Manu   7.456780       3rd  2015.0
6     NaN  50.345670       8th     NaN
7    jhon  12.346000       NaN  2010.0
8    jack  45.345670    m.tech     NaN

In [27]:
d.dropna(how="any")

    name     marks education   y.o.b
1   Mani  30.23456   diploma  1992.0
2   Pari  21.23456       bsc  2000.0
4  Jessi  10.45670       6th  2012.0
5   Manu   7.45678       3rd  2015.0